[Killed] BlockStatement
calculator/src/helpers/functions.js:1:30
-export const add = (x, y) => {
-  return x + y;
-};
+export const add = (x, y) => {};
 
 export const substract = (x, y) => {
killedBy: Arithmetic functions Should add two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: undefined

[Killed] ArithmeticOperator
calculator/src/helpers/functions.js:2:10
 export const add = (x, y) => {
-  return x + y;
+  return x - y;
 };
 
killedBy: Arithmetic functions Should add two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: -10

[Killed] BlockStatement
calculator/src/helpers/functions.js:5:36
   return x + y;
 };
 
-export const substract = (x, y) => {
-  return x - y;
-};
+export const substract = (x, y) => {};
 
 export const multiply = (x, y) => {
killedBy: Arithmetic functions Should substract two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
calculator/src/helpers/functions.js:6:10
 };
 
 export const substract = (x, y) => {
-  return x - y;
+  return x + y;
 };
 
killedBy: Arithmetic functions Should substract two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 30

[Killed] BlockStatement
calculator/src/helpers/functions.js:9:35
   return x - y;
 };
 
-export const multiply = (x, y) => {
-  return x * y;
-};
+export const multiply = (x, y) => {};
 
 export const divide = (x, y) => {
killedBy: Arithmetic functions Should multiply two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] ArithmeticOperator
calculator/src/helpers/functions.js:10:10
 };
 
 export const multiply = (x, y) => {
-  return x * y;
+  return x / y;
 };
 
killedBy: Arithmetic functions Should multiply two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0.75

[Killed] BlockStatement
calculator/src/helpers/functions.js:13:33
   return x * y;
 };
 
-export const divide = (x, y) => {
-  return x / y;
-};
+export const divide = (x, y) => {};
 
 export const pow = (x, y) => {
killedBy: Arithmetic functions Should divide two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
calculator/src/helpers/functions.js:14:10
 };
 
 export const divide = (x, y) => {
-  return x / y;
+  return x * y;
 };
 
killedBy: Arithmetic functions Should divide two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 80

[Killed] BlockStatement
calculator/src/helpers/functions.js:17:30
   return x / y;
 };
 
-export const pow = (x, y) => {
-  let value = x;
-  for (var i = 0; i < y - 1; i++) {
-    value *= x;
-  }
-  return value;
-};
+export const pow = (x, y) => {};
 
 export const sqrt = (x) => {
killedBy: Arithmetic functions Should square a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 27
Received: undefined

[Killed] ArithmeticOperator
calculator/src/helpers/functions.js:19:23
 
 export const pow = (x, y) => {
   let value = x;
-  for (var i = 0; i < y - 1; i++) {
+  for (var i = 0; i < y + 1; i++) {
     value *= x;
   }
killedBy: Arithmetic functions Should square a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 27
Received: 243

[Killed] EqualityOperator
calculator/src/helpers/functions.js:19:19
 
 export const pow = (x, y) => {
   let value = x;
-  for (var i = 0; i < y - 1; i++) {
+  for (var i = 0; i >= y - 1; i++) {
     value *= x;
   }
killedBy: Arithmetic functions Should square a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 27
Received: 3

[Killed] AssignmentOperator
calculator/src/helpers/functions.js:20:5
 export const pow = (x, y) => {
   let value = x;
   for (var i = 0; i < y - 1; i++) {
-    value *= x;
+    value /= x;
   }
   return value;
killedBy: Arithmetic functions Should square a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 27
Received: 0.3333333333333333

[Killed] BlockStatement
calculator/src/helpers/functions.js:25:28
   return value;
 };
 
-export const sqrt = (x) => {
-  const square = (n, i, j) => {
-    let mid = (i + j) / 2;
-    let mul = mid * mid;
-    if (mul === n || Math.abs(mul - n) < 0.00001) {
-      return mid;
-    } else if (mul < n) {
-      return square(n, mid, j);
-    } else {
-      return square(n, i, mid);
-    }
-  };
-  let i = 1;
-  const found = false;
-  while (!found) {
-    if (i * i === x) {
-      return i;
-    } else if (i * i > x) {
-      let value = square(x, i - 1, i);
-      return value;
-    }
-    i++;
-  }
-};
+export const sqrt = (x) => {};
 
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Survived] BlockStatement
calculator/src/helpers/functions.js:26:31
 };
 
 export const sqrt = (x) => {
-  const square = (n, i, j) => {
-    let mid = (i + j) / 2;
-    let mul = mid * mid;
-    if (mul === n || Math.abs(mul - n) < 0.00001) {
-      return mid;
-    } else if (mul < n) {
-      return square(n, mid, j);
-    } else {
-      return square(n, i, mid);
-    }
-  };
+  const square = (n, i, j) => {};
   let i = 1;
   const found = false;

[Survived] ArithmeticOperator
calculator/src/helpers/functions.js:27:16
 
 export const sqrt = (x) => {
   const square = (n, i, j) => {
-    let mid = (i + j) / 2;
+    let mid = (i - j) / 2;
     let mul = mid * mid;
     if (mul === n || Math.abs(mul - n) < 0.00001) {

[Survived] ArithmeticOperator
calculator/src/helpers/functions.js:27:15
 
 export const sqrt = (x) => {
   const square = (n, i, j) => {
-    let mid = (i + j) / 2;
+    let mid = (i + j) * 2;
     let mul = mid * mid;
     if (mul === n || Math.abs(mul - n) < 0.00001) {

[Survived] ArithmeticOperator
calculator/src/helpers/functions.js:28:15
 export const sqrt = (x) => {
   const square = (n, i, j) => {
     let mid = (i + j) / 2;
-    let mul = mid * mid;
+    let mul = mid / mid;
     if (mul === n || Math.abs(mul - n) < 0.00001) {
       return mid;

[Survived] ConditionalExpression
calculator/src/helpers/functions.js:29:9
   const square = (n, i, j) => {
     let mid = (i + j) / 2;
     let mul = mid * mid;
-    if (mul === n || Math.abs(mul - n) < 0.00001) {
+    if (true) {
       return mid;
     } else if (mul < n) {

[Survived] EqualityOperator
calculator/src/helpers/functions.js:29:22
   const square = (n, i, j) => {
     let mid = (i + j) / 2;
     let mul = mid * mid;
-    if (mul === n || Math.abs(mul - n) < 0.00001) {
+    if (mul === n || Math.abs(mul - n) <= 0.00001) {
       return mid;
     } else if (mul < n) {

[Survived] ConditionalExpression
calculator/src/helpers/functions.js:31:16
     let mul = mid * mid;
     if (mul === n || Math.abs(mul - n) < 0.00001) {
       return mid;
-    } else if (mul < n) {
+    } else if (true) {
       return square(n, mid, j);
     } else {

[Survived] BlockStatement
calculator/src/helpers/functions.js:31:25
     let mul = mid * mid;
     if (mul === n || Math.abs(mul - n) < 0.00001) {
       return mid;
-    } else if (mul < n) {
-      return square(n, mid, j);
-    } else {
+    } else if (mul < n) {} else {
       return square(n, i, mid);
     }

[Survived] BlockStatement
calculator/src/helpers/functions.js:33:12
       return mid;
     } else if (mul < n) {
       return square(n, mid, j);
-    } else {
-      return square(n, i, mid);
-    }
+    } else {}
   };
   let i = 1;

[Killed] BooleanLiteral
calculator/src/helpers/functions.js:38:17
     }
   };
   let i = 1;
-  const found = false;
+  const found = true;
   while (!found) {
     if (i * i === x) {
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
calculator/src/helpers/functions.js:39:10
   };
   let i = 1;
   const found = false;
-  while (!found) {
+  while (false) {
     if (i * i === x) {
       return i;
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BooleanLiteral
calculator/src/helpers/functions.js:39:10
   };
   let i = 1;
   const found = false;
-  while (!found) {
+  while (found) {
     if (i * i === x) {
       return i;
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
calculator/src/helpers/functions.js:40:22
   let i = 1;
   const found = false;
   while (!found) {
-    if (i * i === x) {
-      return i;
-    } else if (i * i > x) {
+    if (i * i === x) {} else if (i * i > x) {
       let value = square(x, i - 1, i);
       return value;
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 3.0000009536743164

[Killed] EqualityOperator
calculator/src/helpers/functions.js:40:9
   let i = 1;
   const found = false;
   while (!found) {
-    if (i * i === x) {
+    if (i * i !== x) {
       return i;
     } else if (i * i > x) {
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] EqualityOperator
calculator/src/helpers/functions.js:42:16
   while (!found) {
     if (i * i === x) {
       return i;
-    } else if (i * i > x) {
+    } else if (i * i <= x) {
       let value = square(x, i - 1, i);
       return value;
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
calculator/src/helpers/functions.js:42:16
   while (!found) {
     if (i * i === x) {
       return i;
-    } else if (i * i > x) {
+    } else if (true) {
       let value = square(x, i - 1, i);
       return value;
killedBy: Arithmetic functions Should calculate square root of a number
statusReason: RangeError: Maximum call stack size exceeded

[Survived] ArithmeticOperator
calculator/src/helpers/functions.js:43:29
     if (i * i === x) {
       return i;
     } else if (i * i > x) {
-      let value = square(x, i - 1, i);
+      let value = square(x, i + 1, i);
       return value;
     }
